dferbas/ethernut/nut/include/arch/cm3/stm/generated/stm32l071_pinmux.h
/* Do not edit!
 * Generated from /devel/cubemx/db/mcu/IPGPIO-STM32L071_gpio_v1_0_Modes.xml*/

#if !defined(_STM32L071_PINMUX_H_)
# define _STM32L071_PINMUX_H_

#define COMP1_OUT_FUNC           0
#define COMP2_OUT_FUNC           1
#define CRS_SYNC_FUNC            2
#define EVENTOUT_FUNC            3
#define I2C1_SCL_FUNC            4
#define I2C1_SDA_FUNC            5
#define I2C1_SMBA_FUNC           6
#define I2C2_SCL_FUNC            7
#define I2C2_SDA_FUNC            8
#define I2C2_SMBA_FUNC           9
#define I2C3_SCL_FUNC            10
#define I2C3_SDA_FUNC            11
#define I2C3_SMBA_FUNC           12
#define I2S2_CK_FUNC             13
#define I2S2_MCK_FUNC            14
#define I2S2_SD_FUNC             15
#define I2S2_WS_FUNC             16
#define LCD_COM0_FUNC            17
#define LCD_COM1_FUNC            18
#define LCD_COM2_FUNC            19
#define LCD_COM3_FUNC            20
#define LCD_COM4_FUNC            21
#define LCD_COM5_FUNC            22
#define LCD_COM6_FUNC            23
#define LCD_COM7_FUNC            24
#define LCD_SEG0_FUNC            25
#define LCD_SEG1_FUNC            26
#define LCD_SEG10_FUNC           27
#define LCD_SEG11_FUNC           28
#define LCD_SEG12_FUNC           29
#define LCD_SEG13_FUNC           30
#define LCD_SEG14_FUNC           31
#define LCD_SEG15_FUNC           32
#define LCD_SEG16_FUNC           33
#define LCD_SEG17_FUNC           34
#define LCD_SEG18_FUNC           35
#define LCD_SEG19_FUNC           36
#define LCD_SEG2_FUNC            37
#define LCD_SEG20_FUNC           38
#define LCD_SEG21_FUNC           39
#define LCD_SEG22_FUNC           40
#define LCD_SEG23_FUNC           41
#define LCD_SEG24_FUNC           42
#define LCD_SEG25_FUNC           43
#define LCD_SEG26_FUNC           44
#define LCD_SEG27_FUNC           45
#define LCD_SEG28_FUNC           46
#define LCD_SEG29_FUNC           47
#define LCD_SEG3_FUNC            48
#define LCD_SEG30_FUNC           49
#define LCD_SEG31_FUNC           50
#define LCD_SEG32_FUNC           51
#define LCD_SEG33_FUNC           52
#define LCD_SEG34_FUNC           53
#define LCD_SEG35_FUNC           54
#define LCD_SEG36_FUNC           55
#define LCD_SEG37_FUNC           56
#define LCD_SEG38_FUNC           57
#define LCD_SEG39_FUNC           58
#define LCD_SEG4_FUNC            59
#define LCD_SEG40_FUNC           60
#define LCD_SEG41_FUNC           61
#define LCD_SEG42_FUNC           62
#define LCD_SEG43_FUNC           63
#define LCD_SEG44_FUNC           64
#define LCD_SEG45_FUNC           65
#define LCD_SEG46_FUNC           66
#define LCD_SEG47_FUNC           67
#define LCD_SEG48_FUNC           68
#define LCD_SEG49_FUNC           69
#define LCD_SEG5_FUNC            70
#define LCD_SEG50_FUNC           71
#define LCD_SEG51_FUNC           72
#define LCD_SEG6_FUNC            73
#define LCD_SEG7_FUNC            74
#define LCD_SEG8_FUNC            75
#define LCD_SEG9_FUNC            76
#define LPTIM1_ETR_FUNC          77
#define LPTIM1_IN1_FUNC          78
#define LPTIM1_IN2_FUNC          79
#define LPTIM1_OUT_FUNC          80
#define LPUART1_CTS_FUNC         81
#define LPUART1_DE_FUNC          82
#define LPUART1_RTS_FUNC         83
#define LPUART1_RX_FUNC          84
#define LPUART1_TX_FUNC          85
#define RCC_MCO_FUNC             86
#define RTC_OUT_ALARM_FUNC       87
#define RTC_OUT_CALIB_FUNC       88
#define RTC_REFIN_FUNC           89
#define SPI1_MISO_FUNC           90
#define SPI1_MOSI_FUNC           91
#define SPI1_NSS_FUNC            92
#define SPI1_SCK_FUNC            93
#define SPI2_MISO_FUNC           94
#define SPI2_MOSI_FUNC           95
#define SPI2_NSS_FUNC            96
#define SPI2_SCK_FUNC            97
#define SYS_SWCLK_FUNC           98
#define SYS_SWDIO_FUNC           99
#define TIM21_CH1_FUNC           100
#define TIM21_CH2_FUNC           101
#define TIM21_ETR_FUNC           102
#define TIM22_CH1_FUNC           103
#define TIM22_CH2_FUNC           104
#define TIM22_ETR_FUNC           105
#define TIM2_CH1_FUNC            106
#define TIM2_CH2_FUNC            107
#define TIM2_CH3_FUNC            108
#define TIM2_CH4_FUNC            109
#define TIM2_ETR_FUNC            110
#define TIM3_CH1_FUNC            111
#define TIM3_CH2_FUNC            112
#define TIM3_CH3_FUNC            113
#define TIM3_CH4_FUNC            114
#define TIM3_ETR_FUNC            115
#define TSC_G1_IO1_FUNC          116
#define TSC_G1_IO2_FUNC          117
#define TSC_G1_IO3_FUNC          118
#define TSC_G1_IO4_FUNC          119
#define TSC_G2_IO1_FUNC          120
#define TSC_G2_IO2_FUNC          121
#define TSC_G2_IO3_FUNC          122
#define TSC_G2_IO4_FUNC          123
#define TSC_G3_IO1_FUNC          124
#define TSC_G3_IO2_FUNC          125
#define TSC_G3_IO3_FUNC          126
#define TSC_G3_IO4_FUNC          127
#define TSC_G4_IO1_FUNC          128
#define TSC_G4_IO2_FUNC          129
#define TSC_G4_IO3_FUNC          130
#define TSC_G4_IO4_FUNC          131
#define TSC_G5_IO1_FUNC          132
#define TSC_G5_IO2_FUNC          133
#define TSC_G5_IO3_FUNC          134
#define TSC_G5_IO4_FUNC          135
#define TSC_G6_IO1_FUNC          136
#define TSC_G6_IO2_FUNC          137
#define TSC_G6_IO3_FUNC          138
#define TSC_G6_IO4_FUNC          139
#define TSC_G7_IO1_FUNC          140
#define TSC_G7_IO2_FUNC          141
#define TSC_G7_IO3_FUNC          142
#define TSC_G7_IO4_FUNC          143
#define TSC_G8_IO1_FUNC          144
#define TSC_G8_IO2_FUNC          145
#define TSC_G8_IO3_FUNC          146
#define TSC_G8_IO4_FUNC          147
#define TSC_SYNC_FUNC            148
#define USART1_CK_FUNC           149
#define UART1_CK_FUNC            149
#define USART1_CTS_FUNC          150
#define UART1_CTS_FUNC           150
#define USART1_DE_FUNC           151
#define UART1_DE_FUNC            151
#define USART1_RTS_FUNC          152
#define UART1_RTS_FUNC           152
#define USART1_RX_FUNC           153
#define UART1_RX_FUNC            153
#define USART1_TX_FUNC           154
#define UART1_TX_FUNC            154
#define USART2_CK_FUNC           155
#define UART2_CK_FUNC            155
#define USART2_CTS_FUNC          156
#define UART2_CTS_FUNC           156
#define USART2_DE_FUNC           157
#define UART2_DE_FUNC            157
#define USART2_RTS_FUNC          158
#define UART2_RTS_FUNC           158
#define USART2_RX_FUNC           159
#define UART2_RX_FUNC            159
#define USART2_TX_FUNC           160
#define UART2_TX_FUNC            160
#define USART4_CK_FUNC           161
#define UART4_CK_FUNC            161
#define USART4_CTS_FUNC          162
#define UART4_CTS_FUNC           162
#define USART4_DE_FUNC           163
#define UART4_DE_FUNC            163
#define USART4_RTS_FUNC          164
#define UART4_RTS_FUNC           164
#define USART4_RX_FUNC           165
#define UART4_RX_FUNC            165
#define USART4_TX_FUNC           166
#define UART4_TX_FUNC            166
#define USART5_CK_FUNC           167
#define UART5_CK_FUNC            167
#define USART5_DE_FUNC           168
#define UART5_DE_FUNC            168
#define USART5_RTS_FUNC          169
#define UART5_RTS_FUNC           169
#define USART5_RX_FUNC           170
#define UART5_RX_FUNC            170
#define USART5_TX_FUNC           171
#define UART5_TX_FUNC            171
#define USB_NOE_FUNC             172

