dferbas/ethernut/nut/include/arch/cm3/stm/generated/stm32l071_pinmux.h
# define PINMUX(gpio, func) ((gpio == PIN_NONE) ? AF_PIN_NONE : 	\
	((gpio == PA00) && (func == TIM2_CH1_FUNC            )) ?  2 : \
	((gpio == PA00) && (func == TSC_G1_IO1_FUNC          )) ?  3 : \
	((gpio == PA00) && (func == USART2_CTS_FUNC          )) ?  4 : \
	((gpio == PA00) && (func == TIM2_ETR_FUNC            )) ?  5 : \
	((gpio == PA00) && (func == USART4_TX_FUNC           )) ?  6 : \
	((gpio == PA00) && (func == COMP1_OUT_FUNC           )) ?  7 : \
	((gpio == PA01) && (func == EVENTOUT_FUNC            )) ?  0 : \
	((gpio == PA01) && (func == LCD_SEG0_FUNC            )) ?  1 : \
	((gpio == PA01) && (func == TIM2_CH2_FUNC            )) ?  2 : \
	((gpio == PA01) && (func == TSC_G1_IO2_FUNC          )) ?  3 : \
	((gpio == PA01) && (func == USART2_DE_FUNC           )) ?  4 : \
	((gpio == PA01) && (func == USART2_RTS_FUNC          )) ?  4 : \
	((gpio == PA01) && (func == TIM21_ETR_FUNC           )) ?  5 : \
	((gpio == PA01) && (func == USART4_RX_FUNC           )) ?  6 : \
	((gpio == PA02) && (func == TIM21_CH1_FUNC           )) ?  0 : \
	((gpio == PA02) && (func == LCD_SEG1_FUNC            )) ?  1 : \
	((gpio == PA02) && (func == TIM2_CH3_FUNC            )) ?  2 : \
	((gpio == PA02) && (func == TSC_G1_IO3_FUNC          )) ?  3 : \
	((gpio == PA02) && (func == USART2_TX_FUNC           )) ?  4 : \
	((gpio == PA02) && (func == LPUART1_TX_FUNC          )) ?  6 : \
	((gpio == PA02) && (func == COMP2_OUT_FUNC           )) ?  7 : \
	((gpio == PA03) && (func == TIM21_CH2_FUNC           )) ?  0 : \
	((gpio == PA03) && (func == LCD_SEG2_FUNC            )) ?  1 : \
	((gpio == PA03) && (func == TIM2_CH4_FUNC            )) ?  2 : \
	((gpio == PA03) && (func == TSC_G1_IO4_FUNC          )) ?  3 : \
	((gpio == PA03) && (func == USART2_RX_FUNC           )) ?  4 : \
	((gpio == PA03) && (func == LPUART1_RX_FUNC          )) ?  6 : \
	((gpio == PA04) && (func == SPI1_NSS_FUNC            )) ?  0 : \
	((gpio == PA04) && (func == TSC_G2_IO1_FUNC          )) ?  3 : \
	((gpio == PA04) && (func == USART2_CK_FUNC           )) ?  4 : \
	((gpio == PA04) && (func == TIM22_ETR_FUNC           )) ?  5 : \
	((gpio == PA05) && (func == SPI1_SCK_FUNC            )) ?  0 : \
	((gpio == PA05) && (func == TIM2_ETR_FUNC            )) ?  2 : \
	((gpio == PA05) && (func == TSC_G2_IO2_FUNC          )) ?  3 : \
	((gpio == PA05) && (func == TIM2_CH1_FUNC            )) ?  5 : \
	((gpio == PA06) && (func == SPI1_MISO_FUNC           )) ?  0 : \
	((gpio == PA06) && (func == LCD_SEG3_FUNC            )) ?  1 : \
	((gpio == PA06) && (func == TIM3_CH1_FUNC            )) ?  2 : \
	((gpio == PA06) && (func == TSC_G2_IO3_FUNC          )) ?  3 : \
	((gpio == PA06) && (func == LPUART1_CTS_FUNC         )) ?  4 : \
	((gpio == PA06) && (func == TIM22_CH1_FUNC           )) ?  5 : \
	((gpio == PA06) && (func == EVENTOUT_FUNC            )) ?  6 : \
	((gpio == PA06) && (func == COMP1_OUT_FUNC           )) ?  7 : \
	((gpio == PA07) && (func == SPI1_MOSI_FUNC           )) ?  0 : \
	((gpio == PA07) && (func == LCD_SEG4_FUNC            )) ?  1 : \
	((gpio == PA07) && (func == TIM3_CH2_FUNC            )) ?  2 : \
	((gpio == PA07) && (func == TSC_G2_IO4_FUNC          )) ?  3 : \
	((gpio == PA07) && (func == TIM22_CH2_FUNC           )) ?  5 : \
	((gpio == PA07) && (func == EVENTOUT_FUNC            )) ?  6 : \
	((gpio == PA07) && (func == COMP2_OUT_FUNC           )) ?  7 : \
	((gpio == PA08) && (func == RCC_MCO_FUNC             )) ?  0 : \
	((gpio == PA08) && (func == LCD_COM0_FUNC            )) ?  1 : \
	((gpio == PA08) && (func == CRS_SYNC_FUNC            )) ?  2 : \
	((gpio == PA08) && (func == EVENTOUT_FUNC            )) ?  3 : \
	((gpio == PA08) && (func == USART1_CK_FUNC           )) ?  4 : \
	((gpio == PA08) && (func == I2C3_SCL_FUNC            )) ?  7 : \
	((gpio == PA09) && (func == RCC_MCO_FUNC             )) ?  0 : \
	((gpio == PA09) && (func == LCD_COM1_FUNC            )) ?  1 : \
	((gpio == PA09) && (func == TSC_G4_IO1_FUNC          )) ?  3 : \
	((gpio == PA09) && (func == USART1_TX_FUNC           )) ?  4 : \
	((gpio == PA09) && (func == I2C1_SCL_FUNC            )) ?  6 : \
	((gpio == PA09) && (func == I2C3_SMBA_FUNC           )) ?  7 : \
	((gpio == PA10) && (func == LCD_COM2_FUNC            )) ?  1 : \
	((gpio == PA10) && (func == TSC_G4_IO2_FUNC          )) ?  3 : \
	((gpio == PA10) && (func == USART1_RX_FUNC           )) ?  4 : \
	((gpio == PA10) && (func == I2C1_SDA_FUNC            )) ?  6 : \
	((gpio == PA11) && (func == SPI1_MISO_FUNC           )) ?  0 : \
	((gpio == PA11) && (func == EVENTOUT_FUNC            )) ?  2 : \
	((gpio == PA11) && (func == TSC_G4_IO3_FUNC          )) ?  3 : \
	((gpio == PA11) && (func == USART1_CTS_FUNC          )) ?  4 : \
	((gpio == PA11) && (func == COMP1_OUT_FUNC           )) ?  7 : \
	((gpio == PA12) && (func == SPI1_MOSI_FUNC           )) ?  0 : \
	((gpio == PA12) && (func == EVENTOUT_FUNC            )) ?  2 : \
	((gpio == PA12) && (func == TSC_G4_IO4_FUNC          )) ?  3 : \
	((gpio == PA12) && (func == USART1_DE_FUNC           )) ?  4 : \
	((gpio == PA12) && (func == USART1_RTS_FUNC          )) ?  4 : \
	((gpio == PA12) && (func == COMP2_OUT_FUNC           )) ?  7 : \
	((gpio == PA13) && (func == SYS_SWDIO_FUNC           )) ?  0 : \
	((gpio == PA13) && (func == USB_NOE_FUNC             )) ?  2 : \
	((gpio == PA13) && (func == LPUART1_RX_FUNC          )) ?  6 : \
	((gpio == PA14) && (func == SYS_SWCLK_FUNC           )) ?  0 : \
	((gpio == PA14) && (func == USART2_TX_FUNC           )) ?  4 : \
	((gpio == PA14) && (func == LPUART1_TX_FUNC          )) ?  6 : \
	((gpio == PA15) && (func == SPI1_NSS_FUNC            )) ?  0 : \
	((gpio == PA15) && (func == LCD_SEG17_FUNC           )) ?  1 : \
	((gpio == PA15) && (func == TIM2_ETR_FUNC            )) ?  2 : \
	((gpio == PA15) && (func == EVENTOUT_FUNC            )) ?  3 : \
	((gpio == PA15) && (func == USART2_RX_FUNC           )) ?  4 : \
	((gpio == PA15) && (func == TIM2_CH1_FUNC            )) ?  5 : \
	((gpio == PA15) && (func == USART4_DE_FUNC           )) ?  6 : \
	((gpio == PA15) && (func == USART4_RTS_FUNC          )) ?  6 : \
	((gpio == PB00) && (func == EVENTOUT_FUNC            )) ?  0 : \
	((gpio == PB00) && (func == LCD_SEG5_FUNC            )) ?  1 : \
	((gpio == PB00) && (func == TIM3_CH3_FUNC            )) ?  2 : \
	((gpio == PB00) && (func == TSC_G3_IO2_FUNC          )) ?  3 : \
	((gpio == PB01) && (func == LCD_SEG6_FUNC            )) ?  1 : \
	((gpio == PB01) && (func == TIM3_CH4_FUNC            )) ?  2 : \
	((gpio == PB01) && (func == TSC_G3_IO3_FUNC          )) ?  3 : \
	((gpio == PB01) && (func == LPUART1_DE_FUNC          )) ?  4 : \
	((gpio == PB01) && (func == LPUART1_RTS_FUNC         )) ?  4 : \
	((gpio == PB02) && (func == LPTIM1_OUT_FUNC          )) ?  2 : \
	((gpio == PB02) && (func == TSC_G3_IO4_FUNC          )) ?  3 : \
	((gpio == PB02) && (func == I2C3_SMBA_FUNC           )) ?  7 : \
	((gpio == PB03) && (func == SPI1_SCK_FUNC            )) ?  0 : \
	((gpio == PB03) && (func == LCD_SEG7_FUNC            )) ?  1 : \
	((gpio == PB03) && (func == TIM2_CH2_FUNC            )) ?  2 : \
	((gpio == PB03) && (func == TSC_G5_IO1_FUNC          )) ?  3 : \
	((gpio == PB03) && (func == EVENTOUT_FUNC            )) ?  4 : \
	((gpio == PB03) && (func == USART1_DE_FUNC           )) ?  5 : \
	((gpio == PB03) && (func == USART1_RTS_FUNC          )) ?  5 : \
	((gpio == PB03) && (func == USART5_TX_FUNC           )) ?  6 : \
	((gpio == PB04) && (func == SPI1_MISO_FUNC           )) ?  0 : \
	((gpio == PB04) && (func == LCD_SEG8_FUNC            )) ?  1 : \
	((gpio == PB04) && (func == TIM3_CH1_FUNC            )) ?  2 : \
	((gpio == PB04) && (func == TSC_G5_IO2_FUNC          )) ?  3 : \
	((gpio == PB04) && (func == TIM22_CH1_FUNC           )) ?  4 : \
	((gpio == PB04) && (func == USART1_CTS_FUNC          )) ?  5 : \
	((gpio == PB04) && (func == USART5_RX_FUNC           )) ?  6 : \
	((gpio == PB04) && (func == I2C3_SDA_FUNC            )) ?  7 : \
	((gpio == PB05) && (func == SPI1_MOSI_FUNC           )) ?  0 : \
	((gpio == PB05) && (func == LCD_SEG9_FUNC            )) ?  1 : \
	((gpio == PB05) && (func == LPTIM1_IN1_FUNC          )) ?  2 : \
	((gpio == PB05) && (func == I2C1_SMBA_FUNC           )) ?  3 : \
	((gpio == PB05) && (func == TIM22_CH2_FUNC           )) ?  4 : \
	((gpio == PB05) && (func == TIM3_CH2_FUNC            )) ?  4 : \
	((gpio == PB05) && (func == USART1_CK_FUNC           )) ?  5 : \
	((gpio == PB05) && (func == USART5_CK_FUNC           )) ?  6 : \
	((gpio == PB05) && (func == USART5_DE_FUNC           )) ?  6 : \
	((gpio == PB05) && (func == USART5_RTS_FUNC          )) ?  6 : \
	((gpio == PB06) && (func == USART1_TX_FUNC           )) ?  0 : \
	((gpio == PB06) && (func == I2C1_SCL_FUNC            )) ?  1 : \
	((gpio == PB06) && (func == LPTIM1_ETR_FUNC          )) ?  2 : \
	((gpio == PB06) && (func == TSC_G5_IO3_FUNC          )) ?  3 : \
	((gpio == PB07) && (func == USART1_RX_FUNC           )) ?  0 : \
	((gpio == PB07) && (func == I2C1_SDA_FUNC            )) ?  1 : \
	((gpio == PB07) && (func == LPTIM1_IN2_FUNC          )) ?  2 : \
	((gpio == PB07) && (func == TSC_G5_IO4_FUNC          )) ?  3 : \
	((gpio == PB07) && (func == USART4_CTS_FUNC          )) ?  6 : \
	((gpio == PB08) && (func == LCD_SEG16_FUNC           )) ?  1 : \
	((gpio == PB08) && (func == TSC_SYNC_FUNC            )) ?  3 : \
	((gpio == PB08) && (func == I2C1_SCL_FUNC            )) ?  4 : \
	((gpio == PB09) && (func == LCD_COM3_FUNC            )) ?  1 : \
	((gpio == PB09) && (func == EVENTOUT_FUNC            )) ?  2 : \
	((gpio == PB09) && (func == I2C1_SDA_FUNC            )) ?  4 : \
	((gpio == PB09) && (func == I2S2_WS_FUNC             )) ?  5 : \
	((gpio == PB09) && (func == SPI2_NSS_FUNC            )) ?  5 : \
	((gpio == PB10) && (func == LCD_SEG10_FUNC           )) ?  1 : \
	((gpio == PB10) && (func == TIM2_CH3_FUNC            )) ?  2 : \
	((gpio == PB10) && (func == TSC_SYNC_FUNC            )) ?  3 : \
	((gpio == PB10) && (func == LPUART1_TX_FUNC          )) ?  4 : \
	((gpio == PB10) && (func == SPI2_SCK_FUNC            )) ?  5 : \
	((gpio == PB10) && (func == I2C2_SCL_FUNC            )) ?  6 : \
	((gpio == PB10) && (func == LPUART1_RX_FUNC          )) ?  7 : \
	((gpio == PB11) && (func == EVENTOUT_FUNC            )) ?  0 : \
	((gpio == PB11) && (func == LCD_SEG11_FUNC           )) ?  1 : \
	((gpio == PB11) && (func == TIM2_CH4_FUNC            )) ?  2 : \
	((gpio == PB11) && (func == TSC_G6_IO1_FUNC          )) ?  3 : \
	((gpio == PB11) && (func == LPUART1_RX_FUNC          )) ?  4 : \
	((gpio == PB11) && (func == I2C2_SDA_FUNC            )) ?  6 : \
	((gpio == PB11) && (func == LPUART1_TX_FUNC          )) ?  7 : \
	((gpio == PB12) && (func == I2S2_WS_FUNC             )) ?  0 : \
	((gpio == PB12) && (func == SPI2_NSS_FUNC            )) ?  0 : \
	((gpio == PB12) && (func == LCD_SEG12_FUNC           )) ?  1 : \
	((gpio == PB12) && (func == LPUART1_DE_FUNC          )) ?  2 : \
	((gpio == PB12) && (func == LPUART1_RTS_FUNC         )) ?  2 : \
	((gpio == PB12) && (func == TSC_G6_IO2_FUNC          )) ?  3 : \
	((gpio == PB12) && (func == I2C2_SMBA_FUNC           )) ?  5 : \
	((gpio == PB12) && (func == EVENTOUT_FUNC            )) ?  6 : \
	((gpio == PB13) && (func == I2S2_CK_FUNC             )) ?  0 : \
	((gpio == PB13) && (func == SPI2_SCK_FUNC            )) ?  0 : \
	((gpio == PB13) && (func == LCD_SEG13_FUNC           )) ?  1 : \
	((gpio == PB13) && (func == RCC_MCO_FUNC             )) ?  2 : \
	((gpio == PB13) && (func == TSC_G6_IO3_FUNC          )) ?  3 : \
	((gpio == PB13) && (func == LPUART1_CTS_FUNC         )) ?  4 : \
	((gpio == PB13) && (func == I2C2_SCL_FUNC            )) ?  5 : \
	((gpio == PB13) && (func == TIM21_CH1_FUNC           )) ?  6 : \
	((gpio == PB14) && (func == I2S2_MCK_FUNC            )) ?  0 : \
	((gpio == PB14) && (func == SPI2_MISO_FUNC           )) ?  0 : \
	((gpio == PB14) && (func == LCD_SEG14_FUNC           )) ?  1 : \
	((gpio == PB14) && (func == RTC_OUT_ALARM_FUNC       )) ?  2 : \
	((gpio == PB14) && (func == RTC_OUT_CALIB_FUNC       )) ?  2 : \
	((gpio == PB14) && (func == TSC_G6_IO4_FUNC          )) ?  3 : \
	((gpio == PB14) && (func == LPUART1_DE_FUNC          )) ?  4 : \
	((gpio == PB14) && (func == LPUART1_RTS_FUNC         )) ?  4 : \
	((gpio == PB14) && (func == I2C2_SDA_FUNC            )) ?  5 : \
	((gpio == PB14) && (func == TIM21_CH2_FUNC           )) ?  6 : \
	((gpio == PB15) && (func == I2S2_SD_FUNC             )) ?  0 : \
	((gpio == PB15) && (func == SPI2_MOSI_FUNC           )) ?  0 : \
	((gpio == PB15) && (func == LCD_SEG15_FUNC           )) ?  1 : \
	((gpio == PB15) && (func == RTC_REFIN_FUNC           )) ?  2 : \
	((gpio == PC00) && (func == LPTIM1_IN1_FUNC          )) ?  0 : \
	((gpio == PC00) && (func == LCD_SEG18_FUNC           )) ?  1 : \
	((gpio == PC00) && (func == EVENTOUT_FUNC            )) ?  2 : \
	((gpio == PC00) && (func == TSC_G7_IO1_FUNC          )) ?  3 : \
	((gpio == PC00) && (func == LPUART1_RX_FUNC          )) ?  6 : \
	((gpio == PC00) && (func == I2C3_SCL_FUNC            )) ?  7 : \
	((gpio == PC01) && (func == LPTIM1_OUT_FUNC          )) ?  0 : \
	((gpio == PC01) && (func == LCD_SEG19_FUNC           )) ?  1 : \
	((gpio == PC01) && (func == EVENTOUT_FUNC            )) ?  2 : \
	((gpio == PC01) && (func == TSC_G7_IO2_FUNC          )) ?  3 : \
	((gpio == PC01) && (func == LPUART1_TX_FUNC          )) ?  6 : \
	((gpio == PC01) && (func == I2C3_SDA_FUNC            )) ?  7 : \
	((gpio == PC02) && (func == LPTIM1_IN2_FUNC          )) ?  0 : \
	((gpio == PC02) && (func == LCD_SEG20_FUNC           )) ?  1 : \
	((gpio == PC02) && (func == I2S2_MCK_FUNC            )) ?  2 : \
	((gpio == PC02) && (func == SPI2_MISO_FUNC           )) ?  2 : \
	((gpio == PC02) && (func == TSC_G7_IO3_FUNC          )) ?  3 : \
	((gpio == PC03) && (func == LPTIM1_ETR_FUNC          )) ?  0 : \
	((gpio == PC03) && (func == LCD_SEG21_FUNC           )) ?  1 : \
	((gpio == PC03) && (func == I2S2_SD_FUNC             )) ?  2 : \
	((gpio == PC03) && (func == SPI2_MOSI_FUNC           )) ?  2 : \
	((gpio == PC03) && (func == TSC_G7_IO4_FUNC          )) ?  3 : \
	((gpio == PC04) && (func == EVENTOUT_FUNC            )) ?  0 : \
	((gpio == PC04) && (func == LCD_SEG22_FUNC           )) ?  1 : \
	((gpio == PC04) && (func == LPUART1_TX_FUNC          )) ?  2 : \
	((gpio == PC05) && (func == LCD_SEG23_FUNC           )) ?  1 : \
	((gpio == PC05) && (func == LPUART1_RX_FUNC          )) ?  2 : \
	((gpio == PC05) && (func == TSC_G3_IO1_FUNC          )) ?  3 : \
	((gpio == PC06) && (func == TIM22_CH1_FUNC           )) ?  0 : \
	((gpio == PC06) && (func == LCD_SEG24_FUNC           )) ?  1 : \
	((gpio == PC06) && (func == TIM3_CH1_FUNC            )) ?  2 : \
	((gpio == PC06) && (func == TSC_G8_IO1_FUNC          )) ?  3 : \
	((gpio == PC07) && (func == TIM22_CH2_FUNC           )) ?  0 : \
	((gpio == PC07) && (func == LCD_SEG25_FUNC           )) ?  1 : \
	((gpio == PC07) && (func == TIM3_CH2_FUNC            )) ?  2 : \
	((gpio == PC07) && (func == TSC_G8_IO2_FUNC          )) ?  3 : \
	((gpio == PC08) && (func == TIM22_ETR_FUNC           )) ?  0 : \
	((gpio == PC08) && (func == LCD_SEG26_FUNC           )) ?  1 : \
	((gpio == PC08) && (func == TIM3_CH3_FUNC            )) ?  2 : \
	((gpio == PC08) && (func == TSC_G8_IO3_FUNC          )) ?  3 : \
	((gpio == PC09) && (func == TIM21_ETR_FUNC           )) ?  0 : \
	((gpio == PC09) && (func == LCD_SEG27_FUNC           )) ?  1 : \
	((gpio == PC09) && (func == TIM3_CH4_FUNC            )) ?  2 : \
	((gpio == PC09) && (func == USB_NOE_FUNC             )) ?  2 : \
	((gpio == PC09) && (func == TSC_G8_IO4_FUNC          )) ?  3 : \
	((gpio == PC09) && (func == I2C3_SDA_FUNC            )) ?  7 : \
	((gpio == PC10) && (func == LPUART1_TX_FUNC          )) ?  0 : \
	((gpio == PC10) && (func == LCD_COM4_FUNC            )) ?  1 : \
	((gpio == PC10) && (func == LCD_SEG28_FUNC           )) ?  1 : \
	((gpio == PC10) && (func == LCD_SEG48_FUNC           )) ?  1 : \
	((gpio == PC10) && (func == USART4_TX_FUNC           )) ?  6 : \
	((gpio == PC11) && (func == LPUART1_RX_FUNC          )) ?  0 : \
	((gpio == PC11) && (func == LCD_COM5_FUNC            )) ?  1 : \
	((gpio == PC11) && (func == LCD_SEG29_FUNC           )) ?  1 : \
	((gpio == PC11) && (func == LCD_SEG49_FUNC           )) ?  1 : \
	((gpio == PC11) && (func == USART4_RX_FUNC           )) ?  6 : \
	((gpio == PC12) && (func == LCD_COM6_FUNC            )) ?  1 : \
	((gpio == PC12) && (func == LCD_SEG30_FUNC           )) ?  1 : \
	((gpio == PC12) && (func == LCD_SEG50_FUNC           )) ?  1 : \
	((gpio == PC12) && (func == USART5_TX_FUNC           )) ?  2 : \
	((gpio == PC12) && (func == USART4_CK_FUNC           )) ?  6 : \
	((gpio == PD00) && (func == TIM21_CH1_FUNC           )) ?  0 : \
	((gpio == PD00) && (func == I2S2_WS_FUNC             )) ?  1 : \
	((gpio == PD00) && (func == SPI2_NSS_FUNC            )) ?  1 : \
	((gpio == PD01) && (func == I2S2_CK_FUNC             )) ?  1 : \
	((gpio == PD01) && (func == SPI2_SCK_FUNC            )) ?  1 : \
	((gpio == PD02) && (func == LPUART1_DE_FUNC          )) ?  0 : \
	((gpio == PD02) && (func == LPUART1_RTS_FUNC         )) ?  0 : \
	((gpio == PD02) && (func == LCD_COM7_FUNC            )) ?  1 : \
	((gpio == PD02) && (func == LCD_SEG31_FUNC           )) ?  1 : \
	((gpio == PD02) && (func == LCD_SEG51_FUNC           )) ?  1 : \
	((gpio == PD02) && (func == TIM3_ETR_FUNC            )) ?  2 : \
	((gpio == PD02) && (func == USART5_RX_FUNC           )) ?  6 : \
	((gpio == PD03) && (func == USART2_CTS_FUNC          )) ?  0 : \
	((gpio == PD03) && (func == LCD_SEG44_FUNC           )) ?  1 : \
	((gpio == PD03) && (func == I2S2_MCK_FUNC            )) ?  2 : \
	((gpio == PD03) && (func == SPI2_MISO_FUNC           )) ?  2 : \
	((gpio == PD04) && (func == USART2_DE_FUNC           )) ?  0 : \
	((gpio == PD04) && (func == USART2_RTS_FUNC          )) ?  0 : \
	((gpio == PD04) && (func == I2S2_SD_FUNC             )) ?  1 : \
	((gpio == PD04) && (func == SPI2_MOSI_FUNC           )) ?  1 : \
	((gpio == PD05) && (func == USART2_TX_FUNC           )) ?  0 : \
	((gpio == PD06) && (func == USART2_RX_FUNC           )) ?  0 : \
	((gpio == PD07) && (func == USART2_CK_FUNC           )) ?  0 : \
	((gpio == PD07) && (func == TIM21_CH2_FUNC           )) ?  1 : \
	((gpio == PD08) && (func == LPUART1_TX_FUNC          )) ?  0 : \
	((gpio == PD08) && (func == LCD_SEG28_FUNC           )) ?  1 : \
	((gpio == PD09) && (func == LPUART1_RX_FUNC          )) ?  0 : \
	((gpio == PD09) && (func == LCD_SEG29_FUNC           )) ?  1 : \
	((gpio == PD10) && (func == LCD_SEG30_FUNC           )) ?  1 : \
	((gpio == PD11) && (func == LPUART1_CTS_FUNC         )) ?  0 : \
	((gpio == PD11) && (func == LCD_SEG31_FUNC           )) ?  1 : \
	((gpio == PD12) && (func == LPUART1_DE_FUNC          )) ?  0 : \
	((gpio == PD12) && (func == LPUART1_RTS_FUNC         )) ?  0 : \
	((gpio == PD12) && (func == LCD_SEG32_FUNC           )) ?  1 : \
	((gpio == PD13) && (func == LCD_SEG33_FUNC           )) ?  1 : \
	((gpio == PD14) && (func == LCD_SEG34_FUNC           )) ?  1 : \
	((gpio == PD15) && (func == CRS_SYNC_FUNC            )) ?  0 : \
	((gpio == PD15) && (func == LCD_SEG35_FUNC           )) ?  1 : \
	((gpio == PE00) && (func == LCD_SEG36_FUNC           )) ?  1 : \
	((gpio == PE00) && (func == EVENTOUT_FUNC            )) ?  2 : \
	((gpio == PE01) && (func == LCD_SEG37_FUNC           )) ?  1 : \
	((gpio == PE01) && (func == EVENTOUT_FUNC            )) ?  2 : \
	((gpio == PE02) && (func == LCD_SEG38_FUNC           )) ?  1 : \
	((gpio == PE02) && (func == TIM3_ETR_FUNC            )) ?  2 : \
	((gpio == PE03) && (func == TIM22_CH1_FUNC           )) ?  0 : \
	((gpio == PE03) && (func == LCD_SEG39_FUNC           )) ?  1 : \
	((gpio == PE03) && (func == TIM3_CH1_FUNC            )) ?  2 : \
	((gpio == PE04) && (func == TIM22_CH2_FUNC           )) ?  0 : \
	((gpio == PE04) && (func == TIM3_CH2_FUNC            )) ?  2 : \
	((gpio == PE05) && (func == TIM21_CH1_FUNC           )) ?  0 : \
	((gpio == PE05) && (func == TIM3_CH3_FUNC            )) ?  2 : \
	((gpio == PE06) && (func == TIM21_CH2_FUNC           )) ?  0 : \
	((gpio == PE06) && (func == TIM3_CH4_FUNC            )) ?  2 : \
	((gpio == PE07) && (func == LCD_SEG45_FUNC           )) ?  1 : \
	((gpio == PE07) && (func == USART5_CK_FUNC           )) ?  6 : \
	((gpio == PE07) && (func == USART5_DE_FUNC           )) ?  6 : \
	((gpio == PE07) && (func == USART5_RTS_FUNC          )) ?  6 : \
	((gpio == PE08) && (func == LCD_SEG46_FUNC           )) ?  1 : \
	((gpio == PE08) && (func == USART4_TX_FUNC           )) ?  6 : \
	((gpio == PE09) && (func == TIM2_CH1_FUNC            )) ?  0 : \
	((gpio == PE09) && (func == LCD_SEG47_FUNC           )) ?  1 : \
	((gpio == PE09) && (func == TIM2_ETR_FUNC            )) ?  2 : \
	((gpio == PE09) && (func == USART4_RX_FUNC           )) ?  6 : \
	((gpio == PE10) && (func == TIM2_CH2_FUNC            )) ?  0 : \
	((gpio == PE10) && (func == LCD_SEG40_FUNC           )) ?  1 : \
	((gpio == PE10) && (func == USART5_TX_FUNC           )) ?  6 : \
	((gpio == PE11) && (func == TIM2_CH3_FUNC            )) ?  0 : \
	((gpio == PE11) && (func == USART5_RX_FUNC           )) ?  6 : \
	((gpio == PE12) && (func == TIM2_CH4_FUNC            )) ?  0 : \
	((gpio == PE12) && (func == SPI1_NSS_FUNC            )) ?  2 : \
	((gpio == PE13) && (func == LCD_SEG41_FUNC           )) ?  1 : \
	((gpio == PE13) && (func == SPI1_SCK_FUNC            )) ?  2 : \
	((gpio == PE14) && (func == LCD_SEG42_FUNC           )) ?  1 : \
	((gpio == PE14) && (func == SPI1_MISO_FUNC           )) ?  2 : \
	((gpio == PE15) && (func == LCD_SEG43_FUNC           )) ?  1 : \
	((gpio == PE15) && (func == SPI1_MOSI_FUNC           )) ?  2 : \
	((gpio == PH00) && (func == CRS_SYNC_FUNC            )) ?  0 : \
	AF_NO_SUCH_PINFUNC)

