dferbas/ethernut/nut/include/arch/cm3/stm/generated/stm32l071_pinmux.h
# define TIMERMUX(gpio, timer_nr, channel_nr) ((gpio == PIN_NONE) ? AF_PIN_NONE : 	\
	((gpio == PA00) && (timer_nr ==  2) && (channel_nr ==  1)) ?  2 : \
	((gpio == PA01) && (timer_nr ==  2) && (channel_nr ==  2)) ?  2 : \
	((gpio == PA02) && (timer_nr == 21) && (channel_nr ==  1)) ?  0 : \
	((gpio == PA02) && (timer_nr ==  2) && (channel_nr ==  3)) ?  2 : \
	((gpio == PA03) && (timer_nr == 21) && (channel_nr ==  2)) ?  0 : \
	((gpio == PA03) && (timer_nr ==  2) && (channel_nr ==  4)) ?  2 : \
	((gpio == PA05) && (timer_nr ==  2) && (channel_nr ==  1)) ?  5 : \
	((gpio == PA06) && (timer_nr ==  3) && (channel_nr ==  1)) ?  2 : \
	((gpio == PA06) && (timer_nr == 22) && (channel_nr ==  1)) ?  5 : \
	((gpio == PA07) && (timer_nr ==  3) && (channel_nr ==  2)) ?  2 : \
	((gpio == PA07) && (timer_nr == 22) && (channel_nr ==  2)) ?  5 : \
	((gpio == PA15) && (timer_nr ==  2) && (channel_nr ==  1)) ?  5 : \
	((gpio == PB00) && (timer_nr ==  3) && (channel_nr ==  3)) ?  2 : \
	((gpio == PB01) && (timer_nr ==  3) && (channel_nr ==  4)) ?  2 : \
	((gpio == PB03) && (timer_nr ==  2) && (channel_nr ==  2)) ?  2 : \
	((gpio == PB04) && (timer_nr ==  3) && (channel_nr ==  1)) ?  2 : \
	((gpio == PB04) && (timer_nr == 22) && (channel_nr ==  1)) ?  4 : \
	((gpio == PB05) && (timer_nr == 22) && (channel_nr ==  2)) ?  4 : \
	((gpio == PB05) && (timer_nr ==  3) && (channel_nr ==  2)) ?  4 : \
	((gpio == PB10) && (timer_nr ==  2) && (channel_nr ==  3)) ?  2 : \
	((gpio == PB11) && (timer_nr ==  2) && (channel_nr ==  4)) ?  2 : \
	((gpio == PB13) && (timer_nr == 21) && (channel_nr ==  1)) ?  6 : \
	((gpio == PB14) && (timer_nr == 21) && (channel_nr ==  2)) ?  6 : \
	((gpio == PC06) && (timer_nr == 22) && (channel_nr ==  1)) ?  0 : \
	((gpio == PC06) && (timer_nr ==  3) && (channel_nr ==  1)) ?  2 : \
	((gpio == PC07) && (timer_nr == 22) && (channel_nr ==  2)) ?  0 : \
	((gpio == PC07) && (timer_nr ==  3) && (channel_nr ==  2)) ?  2 : \
	((gpio == PC08) && (timer_nr ==  3) && (channel_nr ==  3)) ?  2 : \
	((gpio == PC09) && (timer_nr ==  3) && (channel_nr ==  4)) ?  2 : \
	((gpio == PD00) && (timer_nr == 21) && (channel_nr ==  1)) ?  0 : \
	((gpio == PD07) && (timer_nr == 21) && (channel_nr ==  2)) ?  1 : \
	((gpio == PE03) && (timer_nr == 22) && (channel_nr ==  1)) ?  0 : \
	((gpio == PE03) && (timer_nr ==  3) && (channel_nr ==  1)) ?  2 : \
	((gpio == PE04) && (timer_nr == 22) && (channel_nr ==  2)) ?  0 : \
	((gpio == PE04) && (timer_nr ==  3) && (channel_nr ==  2)) ?  2 : \
	((gpio == PE05) && (timer_nr == 21) && (channel_nr ==  1)) ?  0 : \
	((gpio == PE05) && (timer_nr ==  3) && (channel_nr ==  3)) ?  2 : \
	((gpio == PE06) && (timer_nr == 21) && (channel_nr ==  2)) ?  0 : \
	((gpio == PE06) && (timer_nr ==  3) && (channel_nr ==  4)) ?  2 : \
	((gpio == PE09) && (timer_nr ==  2) && (channel_nr ==  1)) ?  0 : \
	((gpio == PE10) && (timer_nr ==  2) && (channel_nr ==  2)) ?  0 : \
	((gpio == PE11) && (timer_nr ==  2) && (channel_nr ==  3)) ?  0 : \
	((gpio == PE12) && (timer_nr ==  2) && (channel_nr ==  4)) ?  0 : \
	AF_NO_SUCH_PINFUNC)
#endif
